Revit 2027 API
CeilingType.ThermalProperties Property
 The calculated and settable thermal properties of the CeilingType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ThermalProperties ThermalProperties { get; }
Public ReadOnly Property ThermalProperties As ThermalProperties
	Get
public:
property ThermalProperties^ ThermalProperties {
	ThermalProperties^ get ();
}
member ThermalProperties : ThermalProperties with get
Property Value
ThermalProperties
Exceptions
Exception | Condition
InvalidOperationException |  The ceiling does not have thermal properties.
See Also
Reference
CeilingType Class
Autodesk.Revit.DB Namespace